Revit 2024 API
SpaceTag.Space Property
The space that the tag is associated with.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Space Space { get; }
Visual Basic
Public ReadOnly Property Space As Space
	Get
Visual C++
public:
property Space^ Space {
	Space^ get ();
}
Remarks
In rare cases, the tag may not be associated to a space. The property will be null in these situations.
See Also
SpaceTag Class
Autodesk.Revit.DB.Mechanical Namespace